## Basics of pandas and numpy

In [1]:
import numpy as np
import pandas as pd

In [2]:
d={"name":['gaurav','Raj'],"Marks":[20,30]}

In [5]:
df=pd.DataFrame(d)

In [6]:
df

     name  Marks
0  gaurav     20
1     Raj     30

In [7]:
df.to_csv("Friends.csv")

In [9]:
df.to_csv("Friends_false.csv",index=False)

In [10]:
df.head(1)

     name  Marks
0  gaurav     20

In [11]:
df.tail(1)

  name  Marks
1  Raj     30

In [12]:
df.describe()

           Marks
count   2.000000
mean   25.000000
std     7.071068
min    20.000000
25%    22.500000
50%    25.000000
75%    27.500000
max    30.000000

In [16]:
golu.to_csv('Golu.csv')

NameError: name 'golu' is not defined

In [17]:
df1=pd.DataFrame({'Name':['Gaurav','Raj','Tiwari'],'Marks':[20,30,10]})

In [20]:
df1

     Name  Marks
0  Gaurav     20
1     Raj     30
2  Tiwari     10

In [21]:
df1.head(3)

     Name  Marks
0  Gaurav     20
1     Raj     30
2  Tiwari     10

In [26]:
df1.to_csv('Marks.csv')

In [34]:
df1.iloc[[0,0],[1,0]]

   Marks    Name
0     20  Gaurav
0     20  Gaurav

In [37]:
df1.drop('Marks',axis=1)

     Name
0  Gaurav
1     Raj
2  Tiwari

In [38]:
df1

     Name  Marks
0  Gaurav     20
1     Raj     30
2  Tiwari     10

In [41]:
df1.loc['Marks']='Score'
df1

         Name  Marks
0      Gaurav     20
1         Raj     30
2      Tiwari     10
Marks   Score  Score

In [42]:
df1.drop('Marks', inplace=True)

In [43]:
df1

     Name Marks
0  Gaurav    20
1     Raj    30
2  Tiwari    10

In [46]:
golu=pd.read_excel('golu.xlsx')
golu

ImportError: Missing optional dependency 'openpyxl'.  Use pip or conda to install openpyxl.

In [48]:
golu=pd.read_excel('golu.xlsx')

In [49]:
golu

   Train  speed     city
0    123     50     agra
1    145     45    Delhi
2    789     80  Chennai

In [54]:
golu.iloc[[0,1],[1]]

   speed
0     50
1     45

In [55]:
golu

   Train  speed     city
0    123     50     agra
1    145     45    Delhi
2    789     80  Chennai

In [56]:
golu.drop(0)

   Train  speed     city
1    145     45    Delhi
2    789     80  Chennai

In [57]:
golu

   Train  speed     city
0    123     50     agra
1    145     45    Delhi
2    789     80  Chennai

In [62]:
golu.drop('city',inplace=False,axis=1)

KeyError: "['city'] not found in axis"

In [61]:
golu

   Train  speed
0    123     50
1    145     45
2    789     80

In [63]:
golu

   Train  speed
0    123     50
1    145     45
2    789     80

In [64]:
golu.rename(columns={'Train':'Train number'})

   Train number  speed
0           123     50
1           145     45
2           789     80

In [65]:
import numpy as np

In [66]:
arr=np.array([[1,2,3,4],[5,6,7,8]])

In [67]:
arr

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [68]:
arr1=np.array(range(1,9))

In [69]:
arr1

array([1, 2, 3, 4, 5, 6, 7, 8])

In [77]:
arr2=np.arange(5,9)
arr2

array([5, 6, 7, 8])

In [79]:
arr2.shape

(4,)

In [80]:
arr1.shape

(8,)

In [81]:
arr.shape

(2, 4)

In [87]:
np.concatenate((arr,arr2),axis=0)

ValueError: all the input arrays must have same number of dimensions, but the array at index 0 has 2 dimension(s) and the array at index 1 has 1 dimension(s)

In [92]:
b=np.random.random(10)

In [93]:
b

array([0.38328095, 0.04449572, 0.90906986, 0.67915702, 0.7480242 ,
       0.08368927, 0.96675284, 0.39044545, 0.48860509, 0.91064122])

In [94]:
a = np.array( [[1], [2], [3]] )

In [95]:
a

array([[1],
       [2],
       [3]])

In [96]:
b = np.array( [[2], [3], [4]] )
b

array([[2],
       [3],
       [4]])

In [97]:
np.hstack((a, b))

array([[1, 2],
       [2, 3],
       [3, 4]])

In [101]:
df=pd.read_csv('DB.csv',encoding='ISO-8859-1')

In [102]:
df

,Area Abbreviation,Area Code,Area,Item Code,Item,Element Code,Element,Unit,latitude,longitude,...,Y2004,Y2005,Y2006,Y2007,Y2008,Y2009,Y2010,Y2011,Y2012,Y2013
0,AF,2,Afghanistan,2511,Wheat and products,5142,Food,1000 tonnes,33.94,67.71,...,3249.0,3486.0,3704.0,4164.0,4252.0,4538.0,4605.0,4711.0,4810,4895
1,AF,2,Afghanistan,2805,Rice (Milled Equivalent),5142,Food,1000 tonnes,33.94,67.71,...,419.0,445.0,546.0,455.0,490.0,415.0,442.0,476.0,425,422
2,AF,2,Afghanistan,2513,Barley and products,5521,Feed,1000 tonnes,33.94,67.71,...,58.0,236.0,262.0,263.0,230.0,379.0,315.0,203.0,367,360
3,AF,2,Afghanistan,2513,Barley and products,5142,Food,1000 tonnes,33.94,67.71,...,185.0,43.0,44.0,48.0,62.0,55.0,60.0,72.0,78,89
4,AF,2,Afghanistan,2514,Maize and products,5521,Feed,1000 tonnes,33.94,67.71,...,120.0,208.0,233.0,249.0,247.0,195.0,178.0,191.0,200,200
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21472,ZW,181,Zimbabwe,2948,Milk - Excluding Butter,5142,Food,1000 tonnes,-19.02,29.15,...,373.0,357.0,359.0,356.0,341.0,385.0,418.0,457.0,426,451
21473,ZW,181,Zimbabwe,2960,"Fish, Seafood",5521,Feed,1000 tonnes,-19.02,29.15,...,5.0,4.0,9.0,6.0,9.0,5.0,15.0,15.0,15,15
21474,ZW,181,Zimbabwe,2960,"Fish, Seafood",5142,Food,1000 tonnes,-19.02,29.15,...,18.0,14.0,17.0,14.0,15.0,18.0,29.0,40.0,40,40
21475,ZW,181,Zimbabwe,2961,"Aquatic Products, Other",5142,Food,1000 tonnes,-19.02,29.15,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0
21476,ZW,181,Zimbabwe,2928,Miscellaneous,5142,Food,1000 tonnes,-19.02,29.15,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0

In [103]:
df.head()

,Area Abbreviation,Area Code,Area,Item Code,Item,Element Code,Element,Unit,latitude,longitude,...,Y2004,Y2005,Y2006,Y2007,Y2008,Y2009,Y2010,Y2011,Y2012,Y2013
0,AF,2,Afghanistan,2511,Wheat and products,5142,Food,1000 tonnes,33.94,67.71,...,3249.0,3486.0,3704.0,4164.0,4252.0,4538.0,4605.0,4711.0,4810,4895
1,AF,2,Afghanistan,2805,Rice (Milled Equivalent),5142,Food,1000 tonnes,33.94,67.71,...,419.0,445.0,546.0,455.0,490.0,415.0,442.0,476.0,425,422
2,AF,2,Afghanistan,2513,Barley and products,5521,Feed,1000 tonnes,33.94,67.71,...,58.0,236.0,262.0,263.0,230.0,379.0,315.0,203.0,367,360
3,AF,2,Afghanistan,2513,Barley and products,5142,Food,1000 tonnes,33.94,67.71,...,185.0,43.0,44.0,48.0,62.0,55.0,60.0,72.0,78,89
4,AF,2,Afghanistan,2514,Maize and products,5521,Feed,1000 tonnes,33.94,67.71,...,120.0,208.0,233.0,249.0,247.0,195.0,178.0,191.0,200,200

In [110]:
df.loc[0:3]

,Area Abbreviation,Area Code,Area,Item Code,Item,Element Code,Element,Unit,latitude,longitude,...,Y2004,Y2005,Y2006,Y2007,Y2008,Y2009,Y2010,Y2011,Y2012,Y2013
0,AF,2,Afghanistan,2511,Wheat and products,5142,Food,1000 tonnes,33.94,67.71,...,3249.0,3486.0,3704.0,4164.0,4252.0,4538.0,4605.0,4711.0,4810,4895
1,AF,2,Afghanistan,2805,Rice (Milled Equivalent),5142,Food,1000 tonnes,33.94,67.71,...,419.0,445.0,546.0,455.0,490.0,415.0,442.0,476.0,425,422
2,AF,2,Afghanistan,2513,Barley and products,5521,Feed,1000 tonnes,33.94,67.71,...,58.0,236.0,262.0,263.0,230.0,379.0,315.0,203.0,367,360
3,AF,2,Afghanistan,2513,Barley and products,5142,Food,1000 tonnes,33.94,67.71,...,185.0,43.0,44.0,48.0,62.0,55.0,60.0,72.0,78,89

In [109]:
df.iloc[4]

Area Abbreviation                    AF
Area Code                             2
Area                        Afghanistan
Item Code                          2514
Item                 Maize and products
                            ...
Y2009                             195.0
Y2010                             178.0
Y2011                             191.0
Y2012                               200
Y2013                               200
Name: 4, Length: 63, dtype: object

In [112]:
df=pd.read_csv('DB.csv',encoding='ISO-8859-1',index_col='Item')

In [113]:
df

,Area Abbreviation,Area Code,Area,Item Code,Element Code,Element,Unit,latitude,longitude,Y1961,...,Y2004,Y2005,Y2006,Y2007,Y2008,Y2009,Y2010,Y2011,Y2012,Y2013
Item,,,,,,,,,,,,,,,,,,,,,
Wheat and products,AF,2,Afghanistan,2511,5142,Food,1000 tonnes,33.94,67.71,1928.0,...,3249.0,3486.0,3704.0,4164.0,4252.0,4538.0,4605.0,4711.0,4810,4895
Rice (Milled Equivalent),AF,2,Afghanistan,2805,5142,Food,1000 tonnes,33.94,67.71,183.0,...,419.0,445.0,546.0,455.0,490.0,415.0,442.0,476.0,425,422
Barley and products,AF,2,Afghanistan,2513,5521,Feed,1000 tonnes,33.94,67.71,76.0,...,58.0,236.0,262.0,263.0,230.0,379.0,315.0,203.0,367,360
Barley and products,AF,2,Afghanistan,2513,5142,Food,1000 tonnes,33.94,67.71,237.0,...,185.0,43.0,44.0,48.0,62.0,55.0,60.0,72.0,78,89
Maize and products,AF,2,Afghanistan,2514,5521,Feed,1000 tonnes,33.94,67.71,210.0,...,120.0,208.0,233.0,249.0,247.0,195.0,178.0,191.0,200,200
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Milk - Excluding Butter,ZW,181,Zimbabwe,2948,5142,Food,1000 tonnes,-19.02,29.15,230.0,...,373.0,357.0,359.0,356.0,341.0,385.0,418.0,457.0,426,451
"Fish, Seafood",ZW,181,Zimbabwe,2960,5521,Feed,1000 tonnes,-19.02,29.15,27.0,...,5.0,4.0,9.0,6.0,9.0,5.0,15.0,15.0,15,15
"Fish, Seafood",ZW,181,Zimbabwe,2960,5142,Food,1000 tonnes,-19.02,29.15,6.0,...,18.0,14.0,17.0,14.0,15.0,18.0,29.0,40.0,40,40
"Aquatic Products, Other",ZW,181,Zimbabwe,2961,5142,Food,1000 tonnes,-19.02,29.15,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0
Miscellaneous,ZW,181,Zimbabwe,2928,5142,Food,1000 tonnes,-19.02,29.15,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0

In [137]:
df.loc[['Wheat and products','Fish, Seafood'],['Area Code','Element']]

                    Area Code Element
Item
Wheat and products          2    Food
Wheat and products          3    Feed
Wheat and products          3    Food
Wheat and products          4    Feed
Wheat and products          4    Food
...                       ...     ...
Fish, Seafood             249    Food
Fish, Seafood             251    Feed
Fish, Seafood             251    Food
Fish, Seafood             181    Feed
Fish, Seafood             181    Food

[610 rows x 2 columns]

In [115]:
import numpy as np

In [133]:
arr=np.array([[1,2,3],[4,5,6]])

In [134]:
arr

array([[1, 2, 3],
       [4, 5, 6]])

In [135]:
l=list(range(100000000))

In [136]:
%time for _ in range(10): [i*3 for i in l]

Wall time: 12min 7s

In [138]:
np.zeros((4,6))

array([[0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0.]])

In [142]:
np.ones((4,6))

array([[1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1.]])

In [141]:
np.empty((4,6))

array([[1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1.]])

In [143]:
arr*arr

array([[ 1,  4,  9],
       [16, 25, 36]])

##Slicing

## Slicing with View

In [144]:
x=np.array([1,2,3,45])

In [145]:
x

array([ 1,  2,  3, 45])

In [146]:
y=x[1:3]

In [147]:
y

array([2, 3])

In [148]:
y[0]=10

In [149]:
x

array([ 1, 10,  3, 45])

In [150]:
y

array([10,  3])

## Slicing with copy

In [173]:
w=np.array([1,2,3,45])

In [174]:
w

array([ 1,  2,  3, 45])

In [175]:
z=w[1:3].copy()

In [176]:
z

array([2, 3])

In [177]:
z[0]=10

In [178]:
z

array([10,  3])

In [179]:
w

array([ 1,  2,  3, 45])